1c/standalone/src/InformationRegisters/Кабиторий_ИсходящиеНамерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Кабиторий_ИсходящиеНамерения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.Кабиторий_ОказаниеУслуги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭффекта</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_ВидыИсходящихЭффектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.Кабиторий_СостоянияНамерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Создано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяПопытка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:base64Binary</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/standalone/src/Enums/Кабиторий_СостоянияНамерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Кабиторий_СостоянияНамерения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетРазбора</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/standalone/src/InformationRegisters/Кабиторий_ИсходящиеНамерения/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Регистрирует исходящее намерение (Outbox, INV-10).
// Вызывается ВНУТРИ доменной транзакции смены статуса (запись участвует в ней).
// Идемпотентно по ключу: повтор с тем же ключом не перезаписывает намерение.
//
// Параметры:
//   Заявка - ДокументСсылка.Кабиторий_ОказаниеУслуги - агрегат-источник
//   ВидЭффекта - EnumRef.Кабиторий_ВидыИсходящихЭффектов - целевой SPI
//   ПолезнаяНагрузка - Произвольный - данные для внешнего вызова (сериализуются)
//   КлючИдемпотентности - Строка - если пуст, генерируется UUID
//
// Возвращаемое значение:
//   Строка - ключ идемпотентности намерения
//
Функция ЗарегистрироватьНамерение(Заявка, ВидЭффекта, ПолезнаяНагрузка = Неопределено, КлючИдемпотентности = "") Экспорт

	Ключ = КлючИдемпотентности;
	Если НЕ ЗначениеЗаполнено(Ключ) Тогда
		Ключ = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;

	Если НамерениеСуществует(Ключ) Тогда
		Возврат Ключ;
	КонецЕсли;

	МенеджерЗаписи = МенеджерЗаписиПоКлючу(Ключ);
	МенеджерЗаписи.Заявка = Заявка;
	МенеджерЗаписи.ВидЭффекта = ВидЭффекта;
	Если ПолезнаяНагрузка <> Неопределено Тогда
		МенеджерЗаписи.ПолезнаяНагрузка = Новый ХранилищеЗначения(ПолезнаяНагрузка);
	КонецЕсли;
	МенеджерЗаписи.Состояние = Перечисления.Кабиторий_СостоянияНамерения.Новое;
	МенеджерЗаписи.Попыток = 0;
	МенеджерЗаписи.Создано = ТекущаяДатаСеанса();
	МенеджерЗаписи.СледующаяПопытка = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать();

	Возврат Ключ;

КонецФункции

// Возвращает намерение по ключу структурой (или Неопределено, если не найдено).
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//
// Возвращаемое значение:
//   Структура, Неопределено - поля намерения; ПолезнаяНагрузка - десериализована
//
Функция ПолучитьНамерение(Ключ) Экспорт

	МенеджерЗаписи = МенеджерЗаписиПоКлючу(Ключ);
	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("КлючИдемпотентности", МенеджерЗаписи.КлючИдемпотентности);
	Результат.Вставить("Заявка", МенеджерЗаписи.Заявка);
	Результат.Вставить("ВидЭффекта", МенеджерЗаписи.ВидЭффекта);
	Результат.Вставить("Состояние", МенеджерЗаписи.Состояние);
	Результат.Вставить("Попыток", МенеджерЗаписи.Попыток);
	Результат.Вставить("Создано", МенеджерЗаписи.Создано);
	Результат.Вставить("СледующаяПопытка", МенеджерЗаписи.СледующаяПопытка);
	Результат.Вставить("ВнешняяСсылка", МенеджерЗаписи.ВнешняяСсылка);
	Результат.Вставить("КодОтказа", МенеджерЗаписи.КодОтказа);
	Результат.Вставить("ОписаниеОтказа", МенеджерЗаписи.ОписаниеОтказа);

	ПолезнаяНагрузка = Неопределено;
	Если ТипЗнч(МенеджерЗаписи.ПолезнаяНагрузка) = Тип("ХранилищеЗначения") Тогда
		ПолезнаяНагрузка = МенеджерЗаписи.ПолезнаяНагрузка.Получить();
	КонецЕсли;
	Результат.Вставить("ПолезнаяНагрузка", ПолезнаяНагрузка);

	Возврат Результат;

КонецФункции

// Переводит намерение в обработку (короткая транзакция + блокировка ключа).
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//
Процедура ОтметитьВОбработке(Ключ) Экспорт

	Изменения = Новый Структура;
	Изменения.Вставить("Состояние", Перечисления.Кабиторий_СостоянияНамерения.ВОбработке);
	ПрименитьИзменения(Ключ, Изменения);

КонецПроцедуры

// Фиксирует успешный внешний эффект: Завершено + externalRef.
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//   ВнешняяСсылка - Строка - непрозрачный externalRef (доказательство эффекта)
//
Процедура ЗафиксироватьУспех(Ключ, ВнешняяСсылка = "") Экспорт

	Изменения = Новый Структура;
	Изменения.Вставить("Состояние", Перечисления.Кабиторий_СостоянияНамерения.Завершено);
	Изменения.Вставить("ВнешняяСсылка", Лев(ВнешняяСсылка, 100));
	ПрименитьИзменения(Ключ, Изменения);

КонецПроцедуры

// Фиксирует ошибку попытки: Состояние=Ошибка, Попыток+1, перенос следующей попытки.
// Решение об исчерпании попыток принимает оркестратор повторов (TODO, числа - TBD).
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//   КодОтказа - Строка - непрозрачный reasonCode
//   ОписаниеОтказа - Строка - reasonDescription
//   ПовторитьЧерезСекунд - Число - задержка до следующей попытки
//
Процедура ЗафиксироватьОшибку(Ключ, КодОтказа, ОписаниеОтказа = "", ПовторитьЧерезСекунд = 0) Экспорт

	НачатьТранзакцию();
	Попытка

		ЗаблокироватьКлюч(Ключ);
		МенеджерЗаписи = МенеджерЗаписиПоКлючу(Ключ);
		МенеджерЗаписи.Прочитать();

		Если НЕ МенеджерЗаписи.Выбран() Тогда
			ВызватьИсключение СтрШаблон("Намерение не найдено: %1", Ключ);
		КонецЕсли;

		МенеджерЗаписи.Попыток = МенеджерЗаписи.Попыток + 1;
		МенеджерЗаписи.Состояние = Перечисления.Кабиторий_СостоянияНамерения.Ошибка;
		МенеджерЗаписи.КодОтказа = Лев(КодОтказа, 100);
		МенеджерЗаписи.ОписаниеОтказа = Лев(ОписаниеОтказа, 500);
		МенеджерЗаписи.СледующаяПопытка = ТекущаяДатаСеанса() + ПовторитьЧерезСекунд;
		МенеджерЗаписи.Записать();

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Помечает намерение требующим ручного разбора (исчерпаны попытки / сирота).
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//   ОписаниеОтказа - Строка - причина эскалации
//
Процедура ПометитьТребуетРазбора(Ключ, ОписаниеОтказа = "") Экспорт

	Изменения = Новый Структура;
	Изменения.Вставить("Состояние", Перечисления.Кабиторий_СостоянияНамерения.ТребуетРазбора);
	Изменения.Вставить("ОписаниеОтказа", Лев(ОписаниеОтказа, 500));
	ПрименитьИзменения(Ключ, Изменения);

КонецПроцедуры

// Возвращает ключи намерений, готовых к обработке (fallback-регламент, §20).
// Не основной механизм: подбирает зависшие намерения (Новое/Ошибка, срок подошёл).
//
// Параметры:
//   Максимум - Число - ограничение выборки
//
// Возвращаемое значение:
//   Массив - ключи идемпотентности (Строка)
//
Функция ВыбратьГотовыеКОбработке(Максимум = 100) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ " + Формат(Максимум, "ЧГ=0; ЧН=1") + "
		|	Намерения.КлючИдемпотентности КАК КлючИдемпотентности
		|ИЗ
		|	РегистрСведений.Кабиторий_ИсходящиеНамерения КАК Намерения
		|ГДЕ
		|	Намерения.Состояние В (&АктивныеСостояния)
		|	И Намерения.СледующаяПопытка <= &Сейчас
		|УПОРЯДОЧИТЬ ПО
		|	Намерения.СледующаяПопытка";

	АктивныеСостояния = Новый Массив;
	АктивныеСостояния.Добавить(Перечисления.Кабиторий_СостоянияНамерения.Новое);
	АктивныеСостояния.Добавить(Перечисления.Кабиторий_СостоянияНамерения.Ошибка);
	Запрос.УстановитьПараметр("АктивныеСостояния", АктивныеСостояния);
	Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Ключи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Ключи.Добавить(Выборка.КлючИдемпотентности);
	КонецЦикла;

	Возврат Ключи;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Применяет изменения полей намерения (короткая транзакция + блокировка ключа).
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//   Изменения - Структура - имя ресурса -> новое значение
//
Процедура ПрименитьИзменения(Ключ, Изменения)

	НачатьТранзакцию();
	Попытка

		ЗаблокироватьКлюч(Ключ);
		МенеджерЗаписи = МенеджерЗаписиПоКлючу(Ключ);
		МенеджерЗаписи.Прочитать();

		Если НЕ МенеджерЗаписи.Выбран() Тогда
			ВызватьИсключение СтрШаблон("Намерение не найдено: %1", Ключ);
		КонецЕсли;

		Для Каждого КлючЗначение Из Изменения Цикл
			МенеджерЗаписи[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;

		МенеджерЗаписи.Записать();

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Создаёт менеджер записи с установленным ключом идемпотентности.
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//
// Возвращаемое значение:
//   РегистрСведенийМенеджерЗаписи.Кабиторий_ИсходящиеНамерения
//
Функция МенеджерЗаписиПоКлючу(Ключ)

	МенеджерЗаписи = РегистрыСведений.Кабиторий_ИсходящиеНамерения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючИдемпотентности = Ключ;
	Возврат МенеджерЗаписи;

КонецФункции

// Накладывает управляемую блокировку на запись по ключу (требует активной транзакции).
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//
Процедура ЗаблокироватьКлюч(Ключ)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.Кабиторий_ИсходящиеНамерения");
	ЭлементБлокировки.УстановитьЗначение("КлючИдемпотентности", Ключ);
	Блокировка.Заблокировать();

КонецПроцедуры

// Проверяет наличие намерения по ключу.
//
// Параметры:
//   Ключ - Строка - ключ идемпотентности
//
// Возвращаемое значение:
//   Булево - Истина, если намерение существует
//
Функция НамерениеСуществует(Ключ)

	МенеджерЗаписи = МенеджерЗаписиПоКлючу(Ключ);
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Выбран();

КонецФункции

#КонецОбласти
